In [1]:
<font color='red'> Pandas </font>

SyntaxError: invalid syntax (<ipython-input-1-6cdd2aba4fea>, line 1)

 <font color='red'> Pandas </font>
<font color='blue'>It
contains data structures and data manipulation tools designed to make data cleaning
and analysis fast and easy in Python </font>. <font color='red'> pandas is often used in tandem with numerical
computing tools like NumPy and SciPy, analytical libraries like statsmodels and
scikit-learn, and data visualization libraries like matplotlib.</font>
<font color='blue'>pandas adopts significant
parts of NumPyâ€™s idiomatic style of array-based computing, especially array-based
functions and a preference for data processing without for loops. pandas is designed for working with tabular or heterogeneous data.</font>


<font color='green'>Series:
A Series is a one-dimensional array-like object containing a sequence of values (of
similar types to NumPy types) and an associated array of data labels, called its index.
The simplest Series is formed from only an array of data:
e.g; obj = pd.Series([4, 7, -5, 3])</font>

<font color='red'> you can create a Series from it by
passing the dict:
  sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
  obj3 = pd.Series(sdata)
  *in output section keys are index and values are value. ***There are many ways to construct a DataFrame, though one of the most common is
from a dict of equal-length lists or NumPy arrays:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)</font>

# <font color='blue'>Pandas Data Frame</font>

In [2]:

import pandas as pd

apples = pd.Series([3,2,0,1])
oranges = pd.Series([3,4,7,8])

#print(apples, oranges)
data = {"apples": apples, "oranges": oranges}
fruits_df = pd.DataFrame(data)
print(fruits_df)

   apples  oranges
0       3        3
1       2        4
2       0        7
3       1        8

In [3]:
import pandas as pd

apples = pd.Series([3,2,0,1], ["a", "b", "c", "d"] )
oranges = pd.Series([3,2,0,1], index = ["mon", "tue", "wed", "thr"])

#print(apples, oranges)
data = {"apples": apples, "oranges": oranges}
fruits_df = pd.DataFrame(data)
print(fruits_df)

     apples  oranges
a       3.0      NaN
b       2.0      NaN
c       0.0      NaN
d       1.0      NaN
mon     NaN      3.0
thr     NaN      1.0
tue     NaN      2.0
wed     NaN      0.0

In [4]:
state = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']
data = {'state': state ,
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}# dict take state as a input 
state_pop_df = pd.DataFrame(data 
                     , index = ['1st', '2nd', '3rd', 
                                '4th', '5th','6th'] ) # the vab data converted into data frame
print(state_pop_df)

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [5]:
state_pop_df =pd.DataFrame(data, columns=['year', 'state', 'pop'])# updating columns
print(state_pop_df)

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [6]:
frame2 = pd.DataFrame(data, 
                      columns=['year', 'state', 'pop', 'debt'],
index=['one', 'two', 'three', 'four','five', 'six']) # we can add new columns and can update the index
frame2.head()

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [7]:
print(frame2.columns)
print( frame2.index )

Index(['year', 'state', 'pop', 'debt'], dtype='object')
Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [8]:
print(data)
#data['state']
# this is dictinary like notation to access or extract
# dataframe column data
frame2["state"]

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [9]:
print(frame2.loc['two'] )
frame2.head()

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [10]:
#Columns can be modified by assignment. For example, 
#the empty 'debt' column could be assigned a scalar value or an array of values:
frame2['debt']=122
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   122
two    2001    Ohio  1.7   122
three  2002    Ohio  3.6   122
four   2001  Nevada  2.4   122
five   2002  Nevada  2.9   122
six    2003  Nevada  3.2   122

In [11]:
# important cell for codes review
import numpy as np
import pandas as pd
state = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']

data = {'state': state ,
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
        index=['one', 'two', 'three', 'four','five', 'six'])
ln=len(frame2)
rng=np.arange(ln)
frame2['debt']=rng
frame2  #point to remember , inserting new values, needs to be match in length of dataFrame (number of elements)

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [12]:
val = pd.Series([-1.2, -1.5, -1.7, -1.2, -1.5, -1.7, 2.2],
            index=['one', 'two', 'three', 'four', 'five',
                   'six', 'seven'])
frame2['debt']=val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  -1.2
two    2001    Ohio  1.7  -1.5
three  2002    Ohio  3.6  -1.7
four   2001  Nevada  2.4  -1.2
five   2002  Nevada  2.9  -1.5
six    2003  Nevada  3.2  -1.7

In [13]:
val = pd.Series([-1.2, -1.5, -1.7, 2.6], index=['two', 'four', 'five', 'six'])
frame2['debt'] = val
frame2 #remmeber index length must be equal to values ( or , do not provide index)

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   2.6

In [14]:
#Assigning a column that already exist will ________ and 
# assigning a column that does not exist will ________

In [15]:
#reindexing and use of ffill value of parameter method
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 3, 6])
print(obj3)
obj3=obj3.reindex(range(8),method='ffill')
obj3

0      blue
3    purple
6    yellow
dtype: object

0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
dtype: object

In [16]:
states=pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio', 'Texas', 'California'])
print(states)
states=states.reindex(['a','b','c','d'],method='ffill')
states

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [17]:
# column name changing using reindex method
states = pd.DataFrame(np.arange(9).reshape((3, 3) ),
index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
print(states)
states_name = ['Texas', 'Utah', 'California','Ohio']
states=states.reindex(columns=states_name)
states

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

   Texas  Utah  California  Ohio
a      1   NaN           2     0
c      4   NaN           5     3
d      7   NaN           8     6

#### Deleting data (row or column from dataframe)

In [18]:
import numpy as np
import pandas as pd
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])
print(data_df)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
del data_df['two']

In [20]:
print(data_df)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [21]:
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")


#You can drop values from the columns by passing axis=1 
#or axis='columns' :
data_df = data_df.drop('two', axis=1)
#data_df.drop('two', axis=1, inplace = True)
print(data_df)

# if i want to remove a row for example 'Colorado', 
# how can we do that

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [22]:
data_df=data_df.drop('Colorado' ,axis=0)#droping rows

In [23]:
data_df

          one  three  four
Ohio        0      2     3
Utah        8     10    11
New York   12     14    15

##### <font color ='green'>Indexing, Selection, and Filtering</font>

In [24]:
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")
df2 = data_df[ ["one", "three"] ]
print(df2)
#print( data_df[2:] ) # same like numpy
#print(data_df["one"] )# dicitonary like style of accessing data
#print(data_df.one[2:])  # filter on both row and column start from row 2 onwards
# Conditonal Selection
print ( data_df.three[data_df['three'] > 5] )# only print values >5 of column three
#print(data_df, "\n")

#f2 = data_df["three"] > 5  # boolean dataframe
#print(df2)
#print( data_df[  data_df["three"] > 5  ] )

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14
Colorado     6
Utah        10
New York    14
Name: three, dtype: int64

##### <font color='red'>Selection with loc and iloc</font>

In [25]:
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")
# in the loc method specify row label first 
# then specify column names
# remember! mutiple column names require array notation
print( data_df.loc[['Colorado','Ohio'], ['two',  'three'] ] )
print("\n")
#print( data_df.iloc[2:, [3, 0, 1] ] ) # using number instead of labels
#print( data_df.iloc[:])
#print ( data_df.iloc[ :3 , :3 ] )
print( data_df.iloc[:, :3])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          two  three
Colorado    5      6
Ohio        1      2


          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

##### <font color='red'>Arithmetic and Data Alignment</font>

In [26]:
#print(list('bcd'))
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), 
                   columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), 
                   columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

print(df1)
print(df2)
print()
# applying plus operation between two data frames
df3 = df1 + df2

print(df3)
# your work is to fill all Nan values of  this df3 with a number, 
# choice of number is yours

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

##### Arithmetic methods with fill values

In [27]:
df1 = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20).reshape((4, 5)),
                    columns=list('abcde'))
#print(df1)
#print(df2)

df2.loc[2,[ 'b','d','e']] = np.nan
print(df2)
df3 = df1 + df2
print()
print("direct + operation without fill_value")
print(df3)
print("--------")
print()
# We can use add method for filling NaN cells with a value
# Nan will be replaced by 0 and then addition operation will apply
print("addition using a method with replacing Nan with 0")
df3 =df1.radd(df2,fill_value=0)
print(df3)

    a     b   c     d     e
0   0   1.0   2   3.0   4.0
1   5   6.0   7   8.0   9.0
2  10   NaN  12   NaN   NaN
3  15  16.0  17  18.0  19.0

direct + operation without fill_value
      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0   NaN  22.0   NaN NaN
3   NaN   NaN   NaN   NaN NaN
--------

addition using a method with replacing Nan with 0
      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0   9.0  22.0  11.0   NaN
3  15.0  16.0  17.0  18.0  19.0

#### Hierarchical Indexing in Series

In [28]:
data=pd.Series(np.random.randn(10),
              index=([['a','a','a','a','b','b','b','d','e','f'],
                    [1,1,1,1,2,2,2,3,4,5]]))# Double indexing 
data

a  1   -0.245424
   1    0.065273
   1   -0.619042
   1   -0.700215
b  2   -0.865033
   2   -0.658206
   2   -0.390485
d  3   -2.400060
e  4    0.049122
f  5   -1.817039
dtype: float64

In [29]:
print(data.loc[:,2])
print(data.loc[['b']])
display(data[['b','e']])

b   -0.865033
b   -0.658206
b   -0.390485
dtype: float64
b  2   -0.865033
   2   -0.658206
   2   -0.390485
dtype: float64

b  2   -0.865033
   2   -0.658206
   2   -0.390485
e  4    0.049122
dtype: float64

Hierarchical indexing plays an important role in reshaping data and group-based
operations like forming a pivot table. For example, you could rearrange the data into
a DataFrame using its unstack method

In [30]:
data=pd.Series(np.random.randn(10),
              index=([['a','a','a','a','b','b','b','d','e','f'],
                    [1,2,3,4,3,2,1,3,4,5]]))
df=data.unstack()# change data into data frame 
print(df)
df.stack()#

          1         2         3         4         5
a  0.062524 -1.029748  0.211441  0.765561       NaN
b -0.131728 -1.035016 -2.077389       NaN       NaN
d       NaN       NaN -0.420761       NaN       NaN
e       NaN       NaN       NaN -0.922042       NaN
f       NaN       NaN       NaN       NaN -0.028269

a  1    0.062524
   2   -1.029748
   3    0.211441
   4    0.765561
b  1   -0.131728
   2   -1.035016
   3   -2.077389
d  3   -0.420761
e  4   -0.922042
f  5   -0.028269
dtype: float64

#### Hierarchical indexing in Data Frame

In [31]:
#With a DataFrame, either axis can have a hierarchical index:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])
frame.index.names=['key1','key2']
frame.columns.names=['states','color']
frame

states     Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [32]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [33]:
frame.swaplevel('key1','key2')

states     Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [34]:
frame.sort_index(level=1)

states     Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [35]:
frame.sort_index()

states     Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [36]:
frame.swaplevel(0,1).sort_index(level=0)

states     Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

#### Summary Statistic by level

In [37]:
#for addition of rows
print(frame.sum(level='key1')) # it adds a=0 and a=3, b=6 and b=9

states  Ohio     Colorado
color  Green Red    Green
key1
a          3   5        7
b         15  17       19

In [38]:
print(frame.sum(level='key2'))

states  Ohio     Colorado
color  Green Red    Green
key2
1          6   8       10
2         12  14       16

In [39]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [40]:
dtf=pd.DataFrame({'a':range(7),
                'b':range(7,0,-1),
                'c':['one','one','one','two','two','two','three'],
                'd':[1,1,1,2,2,2,3]})
dtf

   a  b      c  d
0  0  7    one  1
1  1  6    one  1
2  2  5    one  1
3  3  4    two  2
4  4  3    two  2
5  5  2    two  2
6  6  1  three  3

In [41]:
dt=dtf.set_index(['c', 'd'])
dt

         a  b
c     d
one   1  0  7
      1  1  6
      1  2  5
two   2  3  4
      2  4  3
      2  5  2
three 3  6  1

In [42]:
#By default the columns are removed from the DataFrame, though you can leave them in
dtf.set_index(['c','d'],drop=False)

         a  b      c  d
c     d
one   1  0  7    one  1
      1  1  6    one  1
      1  2  5    one  1
two   2  3  4    two  2
      2  4  3    two  2
      2  5  2    two  2
three 3  6  1  three  3

In [43]:
#reset_index , on the other hand, does the opposite of set_index ; the hierarchical index levels are moved into the columns
dtf.reset_index()

   index  a  b      c  d
0      0  0  7    one  1
1      1  1  6    one  1
2      2  2  5    one  1
3      3  3  4    two  2
4      4  4  3    two  2
5      5  5  2    two  2
6      6  6  1  three  3

### <font color='red'>Combining and Merging Datasets</font>

In [44]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})
df=pd.merge(df1,df2)
df

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [45]:
df_on_key=pd.merge(df1,df2,on ='key')
df_on_key

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [46]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],'data2': range(3)})
df_join=pd.merge(df3,df4,left_on='lkey',right_on='rkey')
df_join

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

<font color='red'>You may notice that the 'c' and 'd' values and associated data are missing from the
result. By default merge does an 'inner' join; the keys in the result are the intersecâ€
tion, or the common set found in both tables. Other possible options are 'left' ,
'right' , and 'outer' . The outer join takes the union of the keys, combining the
effect of applying both left and right joins</font>

Different Types of SQL JOINs
(outer) JOIN: Returns records all values in both tables.

(INNER) JOIN: Returns records that have matching values in both tables.

LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table.

RIGHT (OUTER) JOIN: Returns all records from the right table, and the matched records from the left table.

In [47]:
df_outer=pd.merge(df1,df2,how='outer')
df_outer

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [48]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],'key2': ['one', 'two', 'one'],'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})
mrg_df=pd.merge(left,right,on=['key1','key2'],how='outer')
mrg_df

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [49]:
lft_dt=pd.DataFrame({'val':np.arange(5),
                     'key':['a','a','b','c','c']})
rght_dt=pd.DataFrame({'val1':np.arange(3)},index=['a','d','b'])
mrg_data=pd.merge(lft_dt,rght_dt,left_on='key',right_index=True)
mrg_data

   val key  val1
0    0   a     0
1    1   a     0
2    2   b     2

In [50]:
right_join=pd.merge(rght_dt,lft_dt,right_on='key',left_index=True)
right_join

   val1  val key
0     0    0   a
1     0    1   a
2     2    2   b

### <font color='green'>Concatenating Along an Axis</font>
<font color='red'>Calling concat with these objects in a list glues together the values and indexesplacing data . side by side or placing data after another</font>

In [51]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2=pd.Series(([2,3]),index=['c','d'])
s3=pd.Series(([4,5]),index=['e','f'])
cont=pd.concat([s1,s2,s3])
cont

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

In [52]:
#By default concat works along axis=0 , producing another Series. If you pass axis=1 ,
#the result will instead be a DataFrame ( axis=1 is the columns):
pd.concat([s1,s2,s3],axis=1)

/home/zulkifel/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  NaN  4.0
f  NaN  NaN  5.0

In [53]:
adata=pd.concat([s1,s3],axis=1,join='inner')
adata

Empty DataFrame
Columns: [0, 1]
Index: []

In [54]:
pd.concat([s1, s3], axis=1, join_axes=[['a', 'c', 'b', 'e']])

/home/zulkifel/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

     0    1
a  0.0  NaN
c  NaN  NaN
b  1.0  NaN
e  NaN  4.0

In [55]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],columns=['three', 'four'])
pd.concat([df1,df2],axis=1,keys=['level1','level2'],sort=True)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [56]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],sort=True)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [57]:
#passing dic instead of keys
pd.concat({'level1': df1, 'level2': df2}, axis=1,sort=True)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [58]:
pd.concat([df1,df2],keys=['level1','level2'],names=['upper','lower'],axis=1,sort=True)

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [59]:
pd.concat([df1, df2], ignore_index=True,sort=True)

   four  one  three  two
0   NaN  0.0    NaN  1.0
1   NaN  2.0    NaN  3.0
2   NaN  4.0    NaN  5.0
3   6.0  NaN    5.0  NaN
4   8.0  NaN    7.0  NaN

In [60]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
data_p=pd.concat([s1,s2],keys=['one','two'])
data_p

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [61]:
data_p.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [62]:
data_p.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [63]:
data_p.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

### <font color='green'>Pivoting "Long" to "Wide" Format.</font>
<font color = blue>pandas.melt . Rather than transâ€
forming one column into many in a new DataFrame, it merges multiple columns into
one, producing a DataFrame that is longer than the input.
Using pivot , we can reshape back to the original layout:</font>

In [75]:
df= pd. DataFrame({'key':['do','go','flow','row','bow'],
                   'A':[1,2,3,4,5],
                   'B':[6,7,8,9,10],
                   'C':[3,2,1,4,5]})
melted=pd.melt(df,['key'])
melted

     key variable  value
0     do        A      1
1     go        A      2
2   flow        A      3
3    row        A      4
4    bow        A      5
5     do        B      6
6     go        B      7
7   flow        B      8
8    row        B      9
9    bow        B     10
10    do        C      3
11    go        C      2
12  flow        C      1
13   row        C      4
14   bow        C      5

In [78]:
reshape=melted.pivot('key','variable','value')
reshape

variable  A   B  C
key
bow       5  10  5
do        1   6  3
flow      3   8  1
go        2   7  2
row       4   9  4

In [80]:
#Since the result of pivot creates an index from the column used as the row labels, we
#may want to use reset_index to move the data back into a column
reshape.reset_index()

variable   key  A   B  C
0          bow  5  10  5
1           do  1   6  3
2         flow  3   8  1
3           go  2   7  2
4          row  4   9  4

In [82]:
#you can specify a subset of columns to use as values columns
pd.melt(df, id_vars=['key'],value_vars=['A','B'])

    key variable  value
0    do        A      1
1    go        A      2
2  flow        A      3
3   row        A      4
4   bow        A      5
5    do        B      6
6    go        B      7
7  flow        B      8
8   row        B      9
9   bow        B     10

In [83]:
pd.melt(df,value_vars=['key','A','B'])

   variable value
0       key    do
1       key    go
2       key  flow
3       key   row
4       key   bow
5         A     1
6         A     2
7         A     3
8         A     4
9         A     5
10        B     6
11        B     7
12        B     8
13        B     9
14        B    10

In [88]:
titanic=pd.read_csv('titanic/test.csv')
titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [91]:
mltd=pd.melt(titanic,id_vars=['Name'],value_vars=['Age'])

In [97]:
reshaped=mltd.pivot('Name','variable','value')
reshaped.head()

variable                                    Age
Name
Abbott, Master. Eugene Joseph              13.0
Abelseth, Miss. Karen Marie                16.0
Abelseth, Mr. Olaus Jorgensen              25.0
Abrahamsson, Mr. Abraham August Johannes   20.0
Abrahim, Mrs. Joseph (Sophie Halaut Easu)  18.0

In [99]:
reshaped.reset_index()

variable                                           Name   Age
0                         Abbott, Master. Eugene Joseph  13.0
1                           Abelseth, Miss. Karen Marie  16.0
2                         Abelseth, Mr. Olaus Jorgensen  25.0
3              Abrahamsson, Mr. Abraham August Johannes  20.0
4             Abrahim, Mrs. Joseph (Sophie Halaut Easu)  18.0
..                                                  ...   ...
413                          de Brito, Mr. Jose Joaquim  32.0
414                de Messemaeker, Mr. Guillaume Joseph  36.5
415       del Carlo, Mrs. Sebastiano (Argenia Genovesi)  24.0
416                 van Billiard, Master. James William   NaN
417                   van Billiard, Master. Walter John  11.5

[418 rows x 2 columns]